music_app/app/models/user.rb

    def generate_session_token
           token = SecureRandom.urlsafe_base64(16)
    while self.class.exists?(session_token: token)
---
SELECT  1 AS one FROM "users" WHERE "users"."session_token" = $1 AND "users"."id" != $2 LIMIT $3  [["session_token", "oiVC3P4pU2gYHdcw--rMGA"], ["id", 1], ["LIMIT", 1]]